## Staging: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |          NAME          |
|--------|------------------------|
| add    | `aws_ecs_service.main` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecs_service.main will be created
  + resource "aws_ecs_service" "main" {
      + cluster                            = "arn:aws:ecs:ca-central-1:394954348146:cluster/saas-procurement-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "saas_procurement-service"
      + platform_version                   = "1.4.0"
      + propagate_tags                     = "SERVICE"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCentre" = "saas-procurement"
        }
      + tags_all                           = {
          + "CostCentre" = "saas-procurement"
        }
      + task_definition                    = "arn:aws:ecs:ca-central-1:394954348146:task-definition/saas-procurement-task:1"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "saas-procurement"
          + container_port   = 8000
          + target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:394954348146:targetgroup/saas-procurement/c0caf8eb8e958ee9"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0d1ca7e7e561a219f",
            ]
          + subnets          = [
              + "subnet-061d1ba72b3063d92",
              + "subnet-08b6b67d74b37e07b",
              + "subnet-0d3a016c7742a6dab",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.saas_procurement_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.saas_procurement"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.main"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.saas_procurement"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ecs_tasks"]

22 tests, 17 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
